# 데이터 분석 보고서 만들기

## R 마크다운이란?

마크다운 문법으로 코드를 작성해 [HTML](https://ko.wikipedia.org/wiki/HTML)로 변환할 수 있습니다. R 마크다운을 이용하면 분석 과정과 결과를 자세하게 기술할 수 있기 때문에 **재현 가능성**을 갖춘 *데이터 분석 보고서*를 만들 수 있습니다.

### R 마크다운 문법 예제

아래와 같이 작성하면 코드와 함께 `summary(cars)`를 실행한 결과물이 출력됩니다.

```{r}
summary(cars)
```

별도로 이미지 파일을 붙여 넣는 작업을 하지 않아도 코드 아래에 그래프를 삽입할 수 있습니다.

```{r}
library(ggplot2)
qplot(data = mpg, x = drv, fill = drv)
```


##########################################################################

문자 앞뒤에 *특수 문자*를 넣으면 기울임체가 됩니다.

문자 앞뒤에 **특수 문자**를 넣으면 강조체가 됩니다.

문자 앞뒤에 ~~특수 문자~~를 넣으면 취소선을 만듭니다.

문자 앞뒤에 [특수 문자](http://www.google.com/search?q=special+character)를 넣으면 하이퍼링크를 만듭니다.

# 1 단계 제목
## 2 단계 제목
### 3 단계 제목
#### 4 단계 제목

데이터 앞부분 일부를 출력하려면 `head()` 를 이용하면 됩니다. `tail()`은 데이터 뒷부분 일부를 출력하는 기능을 합니다.


##########################################################################

```{r}
summary(cars)
 
library(ggplot2)
qplot(data = mpg, x = drv, fill = drv)
```

